#+title: Lab2
#+PROPERTY: header-args :results drawer

Welcome to Lab2 of *Leveraging Kubernetes for Drupal: A Beginner's Laboratory*

[[org:../repos/labs/DrupalDay2024/lab1.org][Lab1 is a pre-requirement before starting Lab2]]


** Intsall kind

   1. Download and install the latest version of kind.
      #+BEGIN_SRC bash
      [ $(uname -m) = x86_64 ] && curl -Lo ./kind https://kind.sigs.k8s.io/dl/v0.24.0/kind-linux-amd64
      chmod +x ./kind
      sudo mv ./kind /usr/local/bin/kind
      #+END_SRC
   2. Verify the installation.
      #+BEGIN_SRC shell
      kind version
      #+END_SRC

      #+RESULTS:
      :results:
      kind v0.24.0 go1.22.6 linux/amd64
      :end:

** Verifying the Change

   After scaling the deployment, you can verify that the number of replicas has been updated by listing the pods:

   #+begin_src sh
   kubectl get pods -n default -l app.kubernetes.io/name=drupal
   #+end_src

   #+RESULTS:
   : NAME                         READY   STATUS    RESTARTS   AGE
   : my-drupal-7df65485cc-9hxpz   1/1     Running   0          45s
   : my-drupal-7df65485cc-ww5p5   1/1     Running   0          14m


   This command lists all pods with the label app.kubernetes.io/name=drupal, which should include your my-drupal pods.
   You should see 2 pods running if the scaling operation was successful.
   Currently there seems to be a bug with the apache container failing with


** Step 1: Prepare Shared Directory

 1. Create a directory on your host system to store Drupal files and database persistently.

   #+BEGIN_SRC bash
   mkdir -p ${MYHOSTPATH}/drupal1
   cd ${MYHOSTPATH}
   chmod o+wx ${MYHOSTPATH}/*
   ls -larth
   pwd
   #+END_SRC

   #+RESULTS:
   : total 88K
   : drwxrwxr-x 24 ricardo ricardo  68K out  5 22:46 ..
   : drwxrwxrwx  5 ricardo ricardo 4,0K out  7 00:06 .
   : drwxrwxrwx  2 ricardo root    4,0K out  7 00:18 drupal1


   Replace $MYHOSTPATH with the actual path where you want to store your data.

 2. Start the cluster and add the local-pvc

   #+BEGIN_SRC bash
   kind create cluster --config kind-config.yaml

   #minikube start --driver=kvm2 && minikube mount /home/ricardo/tmp/lab1:/lab1
   #k3d cluster create drupal-cluster --servers 1 --agents 2 --volume $MYHOSTPATH:/lab1
   #kubectl apply -f local-pvc-db-drupal.yaml
   #+END_SRC

   WARNING: Both applications have some issues mounting external volumes

** Step 2: Install Drupal with Helm using a PVC

 1. Create a PersistentVolumeClaim (PVC)

   #+BEGIN_SRC bash

   echo '
apiVersion: v1
kind: PersistentVolume
metadata:
  name: drupal1-pv-volume
  labels:
    type: local
spec:
  storageClassName: manual
  capacity:
    storage: 1Gi
  accessModes:
    - ReadWriteOnce
  hostPath:
    path: "/lab1/drupal1"
---
apiVersion: v1
kind: PersistentVolumeClaim
metadata:
  name: drupal1-pv-claim
spec:
  storageClassName: manual
  accessModes:
    - ReadWriteOnce
  resources:
    requests:
      storage: 1Gi
   ' | kubectl apply -f -
   #+END_SRC

   #+RESULTS:
   : persistentvolume/drupal1-pv-volume created
   : persistentvolumeclaim/drupal1-pv-claim created

 2. Install the Drupal chart with the =PVC= persistence setting.

   #+BEGIN_SRC sh
   helm install my-drupal bitnami/drupal \
     --set persistence.enabled=true,persistence.existingClaim=drupal1-pv-claim,mariadb.primary.persistence.existingClaim=drupal1-pv-claim
   #+END_SRC

   #+RESULTS:
   #+begin_example
   NAME: my-drupal2
   LAST DEPLOYED: Sun Oct  6 23:38:09 2024
   NAMESPACE: default
   STATUS: deployed
   REVISION: 1
   TEST SUITE: None
   NOTES:
   CHART NAME: drupal
   CHART VERSION: 20.0.9
   APP VERSION: 11.0.5** Please be patient while the chart is being deployed **

   1. Get the Drupal URL:

     NOTE: It may take a few minutes for the LoadBalancer IP to be available.
           Watch the status with: 'kubectl get svc --namespace default -w my-drupal2'

     export SERVICE_IP=$(kubectl get svc --namespace default my-drupal2 --template "{{ range (index .status.loadBalancer.ingress 0) }}{{ . }}{{ end }}")
     echo "Drupal URL: http://$SERVICE_IP/"

   2. Get your Drupal login credentials by running:

     echo Username: user
     echo Password: $(kubectl get secret --namespace default my-drupal2 -o jsonpath="{.data.drupal-password}" | base64 -d)

   WARNING: There are "resources" sections in the chart not set. Using "resourcesPreset" is not recommended for production. For production installations, please set the following values according to your workload needs:
     - resources
   +info https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
   #+end_example


** Full working commands
   
   k3d does no support nfs mounts and kind has some other problems with it, therefore we use =minikube= to demonstrate nfs pvc across nodes

   #+BEGIN_SRC bash :results pp
   minikube start

   helm install nfs-subdir-external-provisioner nfs-subdir-external-provisioner/nfs-subdir-external-provisioner \
         --set nfs.server=10.10.10.108 \
         --set nfs.path=/opt/lab1


   echo '
   apiVersion: v1
   kind: PersistentVolumeClaim
   metadata:
     name: nfs-drupal-pv-claim
   spec:
     accessModes:
       - ReadWriteOnce
     storageClassName: "nfs-client"
     resources:
       requests:
         storage: 1Gi
   ' | kubectl apply -f -


   helm install nfs-drupal bitnami/drupal \
     --set image.debug=true,persistence.enabled=true,persistence.existingClaim=nfs-drupal-pv-claim,mariadb.primary.persistence.existingClaim=nfs-drupal-pv-claim
   #+END_SRC


   1. Get the Drupal URL:

     NOTE: It may take a few minutes for the LoadBalancer IP to be available.
           Watch the status with: 'kubectl get svc --namespace default -w my-drupal'

     export SERVICE_IP=$(kubectl get svc --namespace default my-drupal --template "{{ range (index .status.loadBalancer.ingress 0) }}{{ . }}{{ end }}")
     echo "Drupal URL: http://$SERVICE_IP/"

   2. Get your Drupal login credentials by running:

     echo Username: user
     echo Password: $(kubectl get secret --namespace default my-drupal -o jsonpath="{.data.drupal-password}" | base64 -d)

   WARNING: There are "resources" sections in the chart not set. Using "resourcesPreset" is not recommended for production. For production installations, please set the following values according to your workload needs:
     - resources
   +info https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
   #+end_example

   #+begin_src bash :results pp
   tree -ush -L 2 /opt/lab1/
   #+end_src

   #+RESULTS:
   #+begin_example
   [ricardo  4.0K]  /opt/lab1/
   ├── [root     4.0K]  default-dynamic-pv-claim-pvc-7e8c6909-060a-46f2-822b-d9ff35ce70b6
   │   ├── [1001     4.0K]  data
   │   ├── [1001     4.0K]  modules
   │   ├── [1001     4.0K]  profiles
   │   ├── [1001     4.0K]  sites
   │   └── [1001     4.0K]  themes
   └── [root     4.0K]  default-my-drupal-pv-claim-pvc-0524da5e-6fcf-454c-8c72-866a240a9a95
       ├── [1001     4.0K]  data
       ├── [1001     4.0K]  modules
       ├── [1001     4.0K]  profiles
       ├── [1001     4.0K]  sites
       └── [1001     4.0K]  themes

   12 directories, 0 files
   #+end_example




